# Individual Coding Exercise (ICE) 1 for HUDK4051: Learning Analytics

In this ICE 1, I've followed the Datacamp tutorial on basic SQL commands. The following are my notes from the tutorial.

## Chapter 1

### Querying the list of people and finding the second person from the list that's displayed

`SELECT name FROM people;`

Answer: Michael Baldwin

### Identifying and fixing error in the code 

Wrong code: 

`'DataCamp <3 SQL
AS result;`

Corrected code:
`SELECT DataCamp <3 SQL
AS result;`

result: DataCamp <3 SQL

### Multi-step Exercises 

`SELECT 'SQL'
AS result;`

result: SQL

`SELECT 'SQL is'
AS result;`

result: SQL is

`SELECT 'SQL is cool'
AS result;`

result: SQL is cool


SQL, which stands for Structured Query Language, is a language for interacting with data stored in something called a relational database.

Relational database are like a collection of tables. A table is just a set of rows and columns, like a spreadsheet, which represents exactly one type of entity. For example, a table might represent employees in a company or purchases made, but not both.

Each row, or record, of a table contains information about a single entity. For example, in a table representing employees, each row represents a single person. Each column, or field, of a table contains a single attribute for all rows in the table. For example, in a table representing employees, we might have a column containing first and last names for all employees.

### SELECTing single columns 

A query is a request for data from a database table (or combination of tables). Querying is an essential skill for a data scientist, since the data you need for your analyses will often live in databases.

In SQL, you can select data from a table using a `SELECT` statement. For example, the following query selects the `name` column from the `people` table:

`SELECT name
 FROM people;`
 
In this query, `SELECT` and `FROM` are called keywords. In SQL, keywords are not case-sensitive, which means you can write the same query as:

`select name
 from people;`
 
 
Instruction: Select the title column from the films table.

`select title
 from films;`


Instruction: Select the release_year column from the films table.
`select release_year
 from films;`


Instruction: Select the name of each person in the people table.
`select name
 from people;`
 
 
Instruction: Get the title of every film from the films table.
`select title
 from films;`
 
Instruction: Get the title and release year for every film.
`select title, release_year
 from films;`

Instruction: Get the title, release year and country for every film.
`select title, release_year, country
 from films;`

Instruction: Get all columns from the films table
`select *
 from films;`
 
### SELECT DISTINCT

Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the DISTINCT keyword.

`select distinct language 
 from films;`
 
Instruction: Get all the unique countries represented in the films table.

`select distinct country 
 from films;`
 
Instruction: Get all the different film certifications from the films table.

`select distinct certification 
 from films;`

Instruction: Get the different types of film roles from the roles table.

`select distinct role 
 from roles;`
 
The COUNT() function lets you do this by returning the number of rows in one or more columns.

For example, this code gives the number of rows in the people table:

`select count(*)
 from people;`

How many records are contained in the reviews table?

`select count(*)
 from reviews;`
 
 Result: 
 Count
 4968
 
To count the number of non-missing values in a particular column, you can call COUNT() on just that column.

For example, to count the number of birth dates present in the people table:
 
`select count(birthdate)
 from people;`
 
It's also common to combine COUNT() with DISTINCT to count the number of distinct values in a column.

For example, this query counts the number of distinct birth dates contained in the people table:

`select count(distinct birthdate)
 from people;`
 
Instructor: Count the number of rows in the people table.

`select count(*)
 from people;`
 
Instructor: Count the number of unique languages in the films table.

`select count(distinct language)
 from films;`

Instructor: Count the number of unique countries in the films table.

`select count(distinct country)
 from films;`

## Ch 2: Filtering results 

In SQL, the WHERE keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison operators you can use:

- = equal
- <> not equal
- < less than
- > greater than
- <= less than or equal to
- >= greater than or equal to

For example, you can filter text records such as title. The following code returns all films with the title 'Metropolis':

`select title 
 from films
 where title = 'Metropolis';`
 
What does the following query return?

`SELECT title
FROM films
WHERE release_year > 2000;`

Result: Films released after the year 2000

### Simple filtering of numeric values 

The WHERE clause can also be used to filter numeric records, such as years or ages.

For example, the following query selects all details for films with a budget over ten thousand dollars:

`SELECT *
FROM films
WHERE budget > 10000;`

Instruction: Get all details for all films released in 2016.

`select *
from films 
where release_year = 2016`

Instruction: Get the number of films released before 2000.

`select count(title)
 from films
 where release_year < 2000;`
 
Result: 1337

Instruction: Get the title and release year of films released after 2000.

`select title, release_year
 from films
 where release_year > 2000;`
 

The WHERE clause can also be used to filter text results, such as names or countries.

For example, this query gets the titles of all films which were filmed in China:

`SELECT title
FROM films
WHERE country = 'China';`

Instruction: Get all details for all French language films.

`select *
from films
where language = 'French';`

Instruction: Get the name and birth date of the person born on November 11th, 1974. Remember to use ISO date format ('1974-11-11')!

`select name, birthdate
 from people
 where birthdate = '1974-11-11';`
 
Instruction: Get the number of Hindi language films.

`select count(title)
 from films
 where language = 'Hindi';`

Instruction: Get all details for all films with an R certification.

`select *
 from films
 where certification = 'R';`
 
### WHERE AND 

Often, we'll want to select data based on multiple conditions. We can build up our WHERE queries by combining multiple conditions with the AND keyword.

For example,

`SELECT title
FROM films
WHERE release_year > 1994
AND release_year < 2000;`
gives us the titles of films released between 1994 and 2000.

Note that we need to specify the column name separately for every AND condition, so the following would be invalid:

`SELECT title
FROM films
WHERE release_year > 1994 AND < 2000;`

You can add as many AND conditions as you need!

Instruction: Get the title and release year for all Spanish language films released before 2000.

`select title, release_year
 from films
 where language = 'Spanish'
 and release_year < 2000;`
 
Instruction: Get all details for Spanish language films released after 2000.
 
 `select *
 from films
 where language = 'Spanish'
 and release_year > 2000;`
 
Instruction: Get all details for Spanish language films released after 2000, but before 2010.
 
 `select *
 from films
 where language = 'Spanish'
 and release_year > 2000
 and release_year < 2010;`
 
 
### WHERE AND OR 

If we want to select rows based on multiple conditions where some but not all of the conditions need to be met, SQL has the OR operator.

For example, the following returns all films released in either 1994 or 2000:

`SELECT title
FROM films
WHERE release_year = 1994
OR release_year = 2000;`

Note that we need to specify the column for every OR condition, so the following is invalid:

`SELECT title
FROM films
WHERE release_year = 1994 OR 2000;`

When combining AND and OR, be sure to enclose the individual clauses in parentheses, like so:

`SELECT title
FROM films
WHERE (release_year = 1994 OR release_year = 1995)
AND (certification = 'PG' OR certification = 'R');`

### WHERE AND OR (2) 

For example, the following query selects all films that were released in 1994 or 1995 which had a rating of PG or R.

`SELECT title
FROM films
WHERE (release_year = 1994 OR release_year = 1995)
AND (certification = 'PG' OR certification = 'R');`

Instruction: Get the title and release year for films released in the 90s.

`select title, release_year
from films
where release_year > 1989
and release_year < 2000`

Instruction: Build on the query to filter the records to only include French or Spanish language films.
 
`select title, release_year
from films
where (release_year > 1989 and release_year < 2000)
and (language = 'French' or 'Spanish');`

Instruction: restrict the query to only return films that took in more than $2M gross.

`select title, release_year
from films
where (release_year > 1989 and release_year < 2000)
and (language = 'French' or 'Spanish');
and gross > 2000000;`

### BETWEEN 

In SQL the BETWEEN keyword provides a useful shorthand for filtering values within a specified range.

`SELECT title
FROM films
WHERE release_year
BETWEEN 1994 AND 2000;`

It's important to remember that BETWEEN is inclusive, meaning the beginning and end values are included in the results.

BETWEEN (2)
Similar to the WHERE clause, the BETWEEN clause can be used with multiple AND and OR operators, so we can build up our queries and make them even more powerful!

For example, suppose we have a table called kids. We can get the names of all kids between the ages of 2 and 12 from the United States:

`SELECT name
FROM kids
WHERE age BETWEEN 2 AND 12
AND nationality = 'USA';`

Instruction: Get the title and release year of all films released between 1990 and 2000 (inclusive).

'select title, release_year
from films
where release_year between 1990 and 2000;`

Instruction: Build on the previous query to select only films that have budgets over $100 million.

`select title, release_year
from films
where release_year between 1990 and 2000
and budget > 100000000;`

Instruction: Restrict the query to only return Spanish language films.

`select title, release_year
from films
where release_year between 1990 and 2000
and budget > 100000000;
and language = 'Spanish';`

Instruction: Modify the previous query to include all Spanish language or French language films with the same criteria as before. 

`select title, release_year
from films
where release_year between 1990 and 2000
and budget > 100000000;
and (language = 'Spanish' or language = 'French';`

### WHERE IN 

WHERE is very useful for filtering results. However, if we want to filter based on many conditions, WHERE can get unwieldy. For example:

`SELECT name
FROM kids
WHERE age = 2
OR age = 4
OR age = 6
OR age = 8
OR age = 10;`

Enter the IN operator! The IN operator allows us to specify multiple values in a WHERE clause, making it easier and quicker to specify multiple OR conditions.

So, the above example would become simply:

`SELECT name
FROM kids
WHERE age IN (2, 4, 6, 8, 10);`

Instruction: Get the title and release year of all films released in 1990 or 2000 that were longer than two hours.

`select title, release_year
 from  films
 where (release_year = 1990 or release_year = 2000)
 and duration > 120;`
 
Instruction: Get the title and language of all films which were in English, Spanish, or French.

`select title, language
 from films
 where language in ('English', 'Spanish', 'French');`


Instruction: Get the title and certification of all films with an NC-17 or R certification.

`select title, certification
 from films
 where certification in ('NC-17', 'R');`
 
### Introduction to NULL and IS NULL 

In SQL, NULL represents a missing or unknown value. We can check for NULL values using the expression IS NULL. For example, to count the number of missing birth dates in the people table:

`SELECT COUNT(*)
FROM people
WHERE birthdate IS NULL;`

As you can see, IS NULL is useful when combined with WHERE to figure out what data you're missing. Sometimes, we'll want to filter out missing values so you only get results which are not NULL. To do this, we can use the IS NOT NULL operator.

For example, this query gives the names of all people whose birth dates are not missing in the people table.

`SELECT name
FROM people
WHERE birthdate IS NOT NULL;`

### NULL and IS NULL 

Instruction: Get the names of people who are still alive, i.e. whose death date is missing.

`select name
 from people
 where deathdate IS NULL;`
 
Instruction: Get the title of every film which doesn't have a budget associated with it.

`select title
 from films
 where budget IS NULL;`
 
Instruction: Get the number of films which don't have a language associated with them.

`select count(title)
 from films
 where language IS NULL;`
 
### LIKE and NOT LIKE 

The WHERE clause can be used to filter text data. However, so far we've only been able to filter by specifying the exact text we're interested in. In the real world, often we'll want to search for a pattern rather than a specific text string.

In SQL, the LIKE operator can be used in a WHERE clause to search for a pattern in a column. To accomplish this, we use something called a wildcard as a placeholder for some other values. There are two wildcards we can use with LIKE:

The % wildcard will match zero, one, or many characters in text. For example, the following query matches companies like 'Data', 'DataC' 'DataCamp', 'DataMind', and so on:

`SELECT name
FROM companies
WHERE name LIKE 'Data%';`

The _ wildcard will match a single character. For example, the following query matches companies like 'DataCamp', 'DataComp', and so on:

`SELECT name
FROM companies
WHERE name LIKE 'DataC_mp';`

We can also use the NOT LIKE operator to find records that don't match the pattern you specify.

Instruction: Get the names of all people whose names begin with 'B'. 

`select name
 from people
 where name like 'B%';`
 
Instruction: Get the names of people whose names have 'r' as the second letter. 

`select name
 from people
 where name like '_r%';`
 
Instruction: Get the names of people whose names don't start with A. 

`select name
 from people
 where name not like 'A%';`

### Aggregate functions 

Often, we will want to perform some calculation on the data in a database. SQL provides a few functions, called aggregate functions, to help you out with this.

For example,

`SELECT AVG(budget)
FROM films;`
gives you the average value from the budget column of the films table. Similarly, the MAX() function returns the highest budget:

`SELECT MAX(budget)
FROM films;`

The SUM() function returns the result of adding up the numeric values in a column:

`SELECT SUM(budget)
FROM films;`


Instruction: Use the SUM() function to get the total duration of all films.

`select sum(duration)
 from films;`
 
Instruction: Get the average duration of all films.

`select avg(duration)
 from films;`
 
Instruction: Get the duration of the shortest film.

`select min(duration)
 from films;`
 
Instruction: Get the duration of the longest film.

`select max(duration)
 from films;`

## Ch 2: Aggregate functions practice 

Instruction: Use the SUM() function to get the total amount grossed by all films.

`select sum(gross)
 from films;`
 
Get the average amount grossed by all films.

`select avg(gross)
 from films;`
 
Get the amount grossed by the worst performing film.

`select min(gross)
 from films;`
 
Get the amount grossed by the best performing film.

`select max(gross)
 from films;`
 
### Combining aggregate functions with WHERE 

Aggregate functions can be combined with the WHERE clause to gain further insights from our data.

For example, to get the total budget of movies made in the year 2010 or later:

`SELECT SUM(budget)
FROM films
WHERE release_year >= 2010;`

Use the SUM() function to get the total amount grossed by all films made in the year 2000 or later.

`select sum(gross)
 from films
 where release_year >=2000;`
 
Get the average amount grossed by all films whose titles start with the letter 'A'.

`select avg(gross)
 from films
 where title LIKE 'A%';`
 
Get the amount grossed by the worst performing film in 1994.

`select min(gross)
 from films
 where release_year = 1994;`
 
Get the amount grossed by the best performing film between 2000 and 2012, inclusive.

`select max(gross)
 from films
 where release_year between 2000 and 2012;`
 
### A note on arithmetic 

In addition to using aggregate functions, we can perform basic arithmetic with symbols like +, -, *, and /.

So, for example, this gives a result of 12:
`SELECT (4 * 3);`

However, the following gives a result of 1:
`SELECT (4 / 3);`

What's going on here? SQL assumes that if you divide an integer by an integer, you want to get an integer back. So be careful when dividing. If you want more precision when dividing, you can add decimal places to your numbers. For example,

`SELECT (4.0 / 3.0) AS result;`

gives you the result you would expect: 1.333.

### It's AS simple AS aliasing 
In the first exercise of this chapter, the column name of our result was just the name of the function we used. For example,

`SELECT MAX(budget)
FROM films;`
gives you a result with one column, named max. But what if you use two functions like this?

`SELECT MAX(budget), MAX(duration)
FROM films;`
Well, then you'd have two columns named max, which isn't very useful.

To avoid situations like this, SQL allows us to do something called aliasing. Aliasing simply means we assign a temporary name to something. To alias, we use the AS keyword. 

For example, in the above example we could use aliases to make the result clearer:

`SELECT MAX(budget) AS max_budget,
       MAX(duration) AS max_duration
FROM films;`

Instruction: Get the title and net profit (the amount a film grossed, minus its budget) for all films. Alias the net profit as net_profit.

`select title as title,
        (gross - budget) as net_profit
 from films;`
 
Get the title and duration in hours for all films.

`select title,
        duration/60.0 as duration_hours
 from films;`
 
Get the average duration in hours for all films, aliased as avg_duration_hours.

`select (avg(duration) / 60.0) as avg_duration_hours
 from films;`
 
### Even more aliasing 


Recall: SQL assumes that if you divide an integer by an integer, you want to get an integer back. This means that the following will erroneously result in 400.0:

SELECT 45 / 10 * 100.0;
This is because 45 / 10 evaluates to an integer (4), and not a decimal number like we would expect.

So when you're dividing make sure at least one of your numbers has a decimal place:

SELECT 45 * 100.0 / 10;
The above now gives the correct answer of 450.0 since the numerator (45 * 100.0) of the division is now a decimal!

Get the percentage of people who are no longer alive. Alias the result as percentage_dead. 

`select count(deathdate) * 100.0 / count(*) as percentage_dead
 from people;`
 
Get the number of years between the newest film and oldest film. Alias the result as difference.

`select (max(release_year) - min(release_year)) as difference
 from films;`

Get the number of decades the films table covers. Alias the result as number_of_decades. The top half of your fraction should be enclosed in parentheses.

`select (max(release_year) - min(release_year)) / 10.0
 as number_of_decades
 from films;`

## ORDER BY 

In SQL, the ORDER BY keyword is used to sort results in ascending or descending order according to the values of one or more columns.

By default ORDER BY will sort in ascending order. If you want to sort the results in descending order, you can use the DESC keyword. For example,

`SELECT title
FROM films
ORDER BY release_year DESC;`
gives you the titles of films sorted by release year, from newest to oldest.

Instruction: Get the names of people from the people table, sorted alphabetically.

`select name
 from people
 order by name;`
 
 Get the names of people, sorted by birth date.
 `select name
  from people
  order by birthdate;`
  
Get the birth date and name for every person, in order of when they were born.
 `select birthdate, name
  from people
  order by birthdate;`

Get the title of films released in 2000 or 2012, in the order they were released

`select title
 from films
 where release_year in (2000, 2012)
 order by release_year;`
 
Get all details for all films except those released in 2015 and order them by duration

`select *
 from films
 where release_year <> 2015
 order by duration;`
 
Get the title and gross earnings for movies which begin with the letter 'M' and order the results alphabetically.

`select title, gross
 from films
 where title like 'M%'
 order by title;`
 
### Sorting single columns (DESC)
To order results in descending order, we can put the keyword DESC after your ORDER BY. For example, to get all the names in the people table, in reverse alphabetical order:

`SELECT name
FROM people
ORDER BY name DESC;`

Instruction: Get the IMDB score and film ID for every film from the reviews table, sorted from highest to lowest score.

`select imdb_score, film_id
 from reviews
 order by imdb_score desc;`

Get the title for every film, in reverse order

`select title
 from films
 order by title desc;`
 
Get the title and duration for every film, in order of longest duration to shortest.

`select title, duration
 from films
 order by duration desc;`
 
### Sorting multiple columns
ORDER BY can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next, and so on. For example,

`SELECT birthdate, name
FROM people
ORDER BY birthdate, name;`
sorts on birth dates first (oldest to newest) and then sorts on the names in alphabetical order. The order of columns is important.

Get the release year, duration, and title of films ordered by their release year and duration.

`select release_year, duration, title
 from films
 order by release_year, duration`

Get certifications, release years, and titles of films ordered by certification (alphabetically) and release year.

`select certification, release_year, title
 from films
 order by certification, release_year;`
 
### GROUP BY
Often we'll need to aggregate results. For example, you might want to count the number of male and female employees in our company. We want to group all the males together and count them, and group all the females together and count them. In SQL, GROUP BY allows us to group a result by one or more columns, like so:

`SELECT sex, count(*)
FROM employees
GROUP BY sex;`
This might give, for example:

sex	count
male	15
female	19

Commonly, GROUP BY is used with aggregate functions like COUNT() or MAX(). Note that GROUP BY always goes after the FROM clause.

Get the release year and count of films released in each year.

`select release_year, count(title)
 from films
 group by release_year;`
 
Get the country and total budget spent making movies in each country.

`select country, sum(budget)
 from films
 group by country;`
 
Remove the budget and gross columns, and group your results by release year.

`select release_year
 from films
 where release_year > 1990
 group by release_year;`
 
Get the country, average budget, and average gross take of countries that have made more than 10 films. Order the result by country name, and limit the number of results displayed to 5. You should alias the averages as avg_budget and avg_gross respectively.

`select country, avg(budget) as avg_budget, avg(gross) as avg_gross
from films
group by country
having count(title) > 10
order by country
limit 5;`